package test.ui.datagenerator;

import java.util.Arrays;
import java.util.List;

public class CategoriesData {
    /**
     * Категории раздела 'Компьютеры и сети' на 21.03.2024
     */
    public static final List<String> preparedComputersAndNetworkCategories = Arrays.asList(
            "Компьютеры и комплектующие",
            "Ноутбуки и аксессуары",
            "Периферия",
            "Сетевое оборудование",
            "Техника для печати и дизайна",
            "Игры и программное обеспечение");
    /**
     * Категории раздела 'Электроника' на 21.03.2024
     */
    public static final List<String> preparedElectronicsCategories = Arrays.asList(
            "Аксессуары для телефонов",
            "Аудиотехника",
            "Гаджеты",
            "Музыкальное оборудование",
            "Планшеты, электронные книги",
            "Телевидение и видео",
            "Телефония и связь",
            "Фото- и видеотехника",
            "Игровая зона");
    /**
     * Категории раздела 'Бытовая техника' на 22.03.2024
     */
    public static final List<String> preparedAppliancesCategories = Arrays.asList(
            "Встраиваемая техника",
            "Климатическая техника",
            "Крупногабаритная техника",
            "Подготовка и обработка продуктов",
            "Приготовление кофе и чая",
            "Приготовление пищи",
            "Уборка, уход за одеждой, пошив",
            "Уход за волосами и телом");
    /**
     * Категории раздела 'Красота и спрорт' на 21.03.2024
     */
    public static final List<String> preparedBeautyAndSportCategories = Arrays.asList(
            "Велосипеды и самокаты",
            "Гироскутеры",
            "Здоровье",
            "Зимние виды спорта",
            "Косметика",
            "Летние виды спорта",
            "Одежда, обувь, аксессуары",
            "Рыбалка",
            "Тренажеры и инвентарь",
            "Туризм и активный отдых",
            "Хобби",
            "Гигиена и уход");
    /**
     * Подкатегория 'Тренажеры и инвентарь' в 'Красота и спорт' категории на 21.03.2024
     */
    public static final List<String> preparedEquipmentSubCategories = Arrays.asList(
            "Беговые дорожки",
            "Велотренажеры",
            "Гантели, гири, штанги",
            "Силовые тренажеры",
            "Эллиптические тренажеры",
            "Степперы, виброплатформы и другие фитнес-тренажеры",
            "Товары для йоги, фитнеса, аэробики",
            "Обручи",
            "Перчатки для единоборств",
            "Груши, мешки, манекены для бокса и единоборств",
            "Коврики для йоги и фитнеса",
            "Спортинвентарь",
            "Аксессуары",
            "Гребные тренажеры");
}



