package test.ui.DataGenerator;

import java.util.Arrays;
import java.util.List;

public class CategoriesData {
    /**
     * Категории раздела 'Электроника' на 21.03.2024
     */
    public static final List<String> preparedElectronicsCategories = Arrays.asList(
            "Аксессуары для телефонов",
            "Аудиотехника",
            "Гаджеты",
            "Музыкальное оборудование",
            "Планшеты, электронные книги",
            "Телевидение и видео",
            "Телефония и связь",
            "Фото- и видеотехника",
            "Игровая зона");
    /**
     * Категории раздела 'Красота и спрорт' на 21.03.2024
     */
    public static final List<String> preparedBeautyAndSportCategories = Arrays.asList(
            "Велосипеды и самокаты",
            "Гироскутеры",
            "Здоровье",
            "Зимние виды спорта",
            "Косметика",
            "Летние виды спорта",
            "Одежда, обувь, аксессуары",
            "Рыбалка",
            "Тренажеры и инвентарь",
            "Туризм и активный отдых",
            "Хобби",
            "Гигиена и уход");
    /**
     * Подкатегории категории'Тренажеры и инвентарь' на 21.03.2024
     */
    public static final List<String> preparedEquipmentSubCategories = Arrays.asList(
            "Беговые дорожки",
            "Велотренажеры",
            "Гантели, гири, штанги",
            "Силовые тренажеры",
            "Эллиптические тренажеры",
            "Степперы, виброплатформы и другие фитнес-тренажеры",
            "Товары для йоги, фитнеса, аэробики",
            "Обручи",
            "Перчатки для единоборств",
            "Груши, мешки, манекены для бокса и единоборств",
            "Коврики для йоги и фитнеса",
            "Спортинвентарь",
            "Аксессуары",
            "Гребные тренажеры");
}



